sources/MeasurementUnits/Catalogs/МСЕдиницыВеличин.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>МСЕдиницыВеличин</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Выражение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Приставка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МСЕдиницыВеличинПриставкиКратныхИДольных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазоваяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МСЕдиницыВеличинБазовые</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательСтепени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

sources/MeasurementUnits/Catalogs/МСЕдиницыВеличин/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

// Для внутреннего использования.
// 
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Обозначение = МСЕдиницыВеличинСервер.СформироватьОбозначениеЕдиницыВеличины(ЭтотОбъект);
	Наименование = МСЕдиницыВеличинСервер.СформироватьНаименованиеЕдиницыВеличины(ЭтотОбъект);
	Код = СформироватьХеш();
КонецПроцедуры

// Для внутреннего использования.
// 
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Код = СформироватьХеш();
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Ссылка", Ссылка);
	
	Дубли = ПоискИУдалениеДублей.НайтиДублиЭлемента("Справочник.МСЕдиницыВеличин", ЭтотОбъект, ДополнительныеПараметры);
	Если Дубли.Количество() > 0 Тогда
		Ошибка = НСтр("ru = 'Единица величины с таким обозначением уже существует.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибка, , "Объект.Обозначение", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьХеш()
	ХэшОбозначения = "";
	ВыражениеТЗ = ЭтотОбъект.Выражение.Выгрузить();
	ВыражениеТЗ.Сортировать("БазоваяЕдиница");
	Для каждого Множитель Из ВыражениеТЗ Цикл
		ХэшОбозначения = ХэшОбозначения
			+ МСЕдиницыВеличинСервер.ПолучитьОбозначениеПриставки(Множитель.Приставка)
			+ МСЕдиницыВеличинСервер.ПолучитьОбозначениеЕдиницыВеличиныБазовой(Множитель.БазоваяЕдиница)
			+ Множитель.ПоказательСтепени
		;
	КонецЦикла;
	Возврат ХэшОбозначения;
КонецФункции

#КонецОбласти

#КонецЕсли
